backend/app/controllers/appointments_controller.rb

	def index
		@appointments = current_user.appointments.order('appt_time ASC')
---
SELECT "appointments".* FROM "appointments" ORDER BY appt_time ASC

	def show
		@appointment = current_user.appointments.find(params[:id])
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."user_id" = ? AND "appointments"."id" = ? LIMIT ?  [["user_id", 2], ["id", 6], ["LIMIT", 1]]

	def update
		@appointment = current_user.appointments.find(params[:id])
		if @appointment.update(appointment_params)
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."user_id" = ? AND "appointments"."id" = ? LIMIT ?  [["user_id", 2], ["id", 6], ["LIMIT", 1]]
UPDATE "appointments" SET "title" = ?, "appt_time" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["title", "New Appo X"], ["appt_time", "2019-06-26 20:51:20"], ["updated_at", "2019-06-09 20:51:37.387027"], ["id", 8]]

	def create
		@appointment = current_user.appointments.new(appointment_params)
		if @appointment.save
---
INSERT INTO "appointments" ("title", "appt_time", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "TEST"], ["appt_time", "2019-06-18 16:40:50"], ["created_at", "2019-06-09 16:41:03.088230"], ["updated_at", "2019-06-09 16:41:03.088230"], ["user_id", 2]]

	def destroy
		@appointment = current_user.appointments.find(params[:id])
		if @appointment.destroy
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."user_id" = ? AND "appointments"."id" = ? LIMIT ?  [["user_id", 2], ["id", 7], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 7]]